const csvData = [
  {
    "학생ID": "1",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "1",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "1",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "1",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "1",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "1",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "2",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "2",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "2",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "2",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "2",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "2",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "3",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "3",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "3",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "3",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "3",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "3",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "4",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "4",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "4",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "4",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "4",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "4",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "5",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "5",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "5",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "5",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "5",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "5",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "6",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "6",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "6",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "6",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "6",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "6",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "13",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "7",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "13",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "7",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "13",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "7",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "13",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "7",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "13",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "7",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "13",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "7",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "13",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "8",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "13",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "8",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "13",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "8",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "13",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "8",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "13",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "8",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "13",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "8",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "13",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "9",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "9",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "9",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "9",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "9",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "9",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "10",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "10",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "10",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "10",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "10",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "10",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "11",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "11",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "11",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "11",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "11",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "11",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "12",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "12",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "12",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "12",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "12",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "12",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "13",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "13",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "13",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "13",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "13",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "13",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "14",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "14",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "14",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "14",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "14",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "14",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "9",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "15",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "9",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "15",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "9",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "15",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "15",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "15",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "15",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "16",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "16",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "16",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "16",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "16",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "16",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "17",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "17",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "17",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "17",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "17",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "17",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "18",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "18",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "18",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "8",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "18",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "8",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "18",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "18",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "19",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "19",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "19",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "19",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "19",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "19",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "20",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "20",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "20",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "20",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "20",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "20",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "21",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "21",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "21",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "21",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "21",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "21",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "22",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "22",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "22",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "22",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "22",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "22",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "23",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "23",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "23",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "23",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "23",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "23",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "24",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "24",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "24",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "24",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "24",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "24",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "25",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "25",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "25",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "25",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "25",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "25",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "26",
    "전공": "본전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "26",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "26",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "26",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "26",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "26",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "27",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "27",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "27",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "27",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "27",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "27",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "28",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "28",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "28",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "28",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "28",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "28",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "29",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "29",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "29",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "29",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "29",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "29",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "30",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "30",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "30",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "30",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "30",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "30",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "31",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "31",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "31",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "31",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "31",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "31",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "32",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "32",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "32",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "32",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "32",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "32",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "33",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "33",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "33",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "33",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "33",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "33",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "34",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "34",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "34",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "34",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "34",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "34",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "35",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "35",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "35",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "35",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "35",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "35",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "36",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "36",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "36",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "36",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "36",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "36",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "37",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "37",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "37",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "37",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "37",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "37",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "38",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "38",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "38",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "38",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "38",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "38",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "39",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "39",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "39",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "39",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "39",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "39",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "40",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "40",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "40",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "40",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "14",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "40",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "14",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "40",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "14",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "41",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "14",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "41",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "14",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "41",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "14",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "41",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "14",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "41",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "14",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "41",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "14",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "42",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "14",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "42",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "14",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "42",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "14",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "42",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "14",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "42",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "14",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "42",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "43",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "43",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "43",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "43",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "43",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "43",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "44",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "44",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "44",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "44",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "44",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "44",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "45",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "45",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "45",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "45",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "45",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "45",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "46",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "46",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "46",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "46",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "46",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "46",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "47",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "47",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "47",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "47",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "11",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "47",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "11",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "47",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "11",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "48",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "48",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "48",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "48",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "48",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "11",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "48",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "11",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "49",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "11",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "49",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "11",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "49",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "49",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "49",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "49",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "50",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "50",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "50",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "50",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "9",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "50",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "9",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "50",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "51",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "51",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "51",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "51",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "51",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "51",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "52",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "52",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "52",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "52",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "52",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "52",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "53",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "11",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "53",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "11",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "53",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "11",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "53",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "53",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "53",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "54",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "54",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "11",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "54",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "11",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "54",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "11",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "54",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "11",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "54",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "55",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "55",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "55",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "55",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "55",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "55",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "56",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "56",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "56",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "56",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "56",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "56",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "57",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "57",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "57",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "57",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "57",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "57",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "58",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "58",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "58",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "58",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "58",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "58",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "59",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "59",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "59",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "59",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "59",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "59",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "60",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "60",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "60",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "60",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "60",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "60",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "61",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "61",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "61",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "61",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "61",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "61",
    "전공": "본전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "62",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "62",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "62",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "62",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "62",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "62",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "63",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "63",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "63",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "63",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "63",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "63",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "64",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "64",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "64",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "64",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "64",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "64",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "65",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "65",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "65",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "65",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "65",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "65",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "66",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "66",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "66",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "66",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "66",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "66",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "67",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "67",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "67",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "67",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "67",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "12",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "67",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "12",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "68",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "12",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "68",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "12",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "68",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "12",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "68",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "12",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "68",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "12",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "68",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "12",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "69",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "12",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "69",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "12",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "69",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "12",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "69",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "12",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "69",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "69",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "70",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "70",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "70",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "70",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "70",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "70",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "71",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "71",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "71",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "71",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "71",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "71",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "72",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "72",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "72",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "72",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "72",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "72",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "73",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "73",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "73",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "73",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "73",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "73",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "74",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "74",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "74",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "74",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "74",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "74",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "75",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "75",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "75",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "75",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "75",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "75",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "76",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "76",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "76",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "76",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "76",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "76",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "77",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "77",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "77",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "77",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "77",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "77",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "78",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "78",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "78",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "78",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "78",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "78",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "79",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "79",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "79",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "79",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "79",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "79",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "80",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "80",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "80",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "80",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "80",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "80",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "81",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "81",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "81",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "81",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "81",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "81",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "82",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "82",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "82",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "82",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "82",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "82",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "83",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "83",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "83",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "83",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "83",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "83",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "84",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "84",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "84",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "84",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "8",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "84",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "84",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "85",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "85",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "85",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "85",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "85",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "8",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "85",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "8",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "86",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "86",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "86",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "86",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "86",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "86",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "87",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "87",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "87",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "87",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "87",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "87",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "88",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "88",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "88",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "88",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "88",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "88",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "89",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "89",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "89",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "89",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "89",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "89",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "90",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "90",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "90",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "90",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "90",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "90",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "91",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "91",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "91",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "91",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "91",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "91",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "92",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "92",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "92",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "92",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "92",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "92",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "93",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "93",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "93",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "93",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "93",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "93",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "94",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "94",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "94",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "94",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "94",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "94",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "95",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "95",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "95",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "95",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "95",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "95",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "96",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "96",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "96",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "96",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "96",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "96",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "97",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "97",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "97",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "97",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "97",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "97",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "98",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "98",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "98",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "98",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "98",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "98",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "99",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "99",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "99",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "99",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "99",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "99",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "100",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "100",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "100",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "100",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "100",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "100",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "101",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "101",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "101",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "101",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "101",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "101",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "102",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "102",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "102",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "102",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "102",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "102",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "103",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "103",
    "전공": "본전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "103",
    "전공": "연계전공(빅데이터AI)",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "103",
    "전공": "연계전공(빅데이터AI)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "103",
    "전공": "연계전공(빅데이터AI)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "103",
    "전공": "연계전공(빅데이터AI)",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "104",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "104",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "104",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "104",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "104",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "104",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "105",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "105",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "105",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "105",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "105",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "105",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "106",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "106",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "106",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "106",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "106",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "106",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "107",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "15",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "107",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "15",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "107",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "15",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "107",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "15",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "107",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "15",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "107",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "15",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "108",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "15",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "108",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "15",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "108",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "15",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "108",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "15",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "108",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "15",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "108",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "15",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "109",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "15",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "109",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "15",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "109",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "15",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "109",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "109",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "109",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "110",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "110",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "110",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "110",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "110",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "110",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "111",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "111",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "111",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "111",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "111",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "111",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "112",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "112",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "112",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "112",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "112",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "112",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "113",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "113",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "113",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "113",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "113",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "113",
    "전공": "복수전공",
    "학년": "4학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "114",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "114",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "114",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "114",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "114",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "114",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "115",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "115",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "115",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "115",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "115",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "115",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "116",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "116",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "116",
    "전공": "연계전공(빅데이터AI)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "116",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "116",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "116",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "117",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "117",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "117",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "117",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "117",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "117",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "118",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "118",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "118",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "4",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "118",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "4",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "118",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "4",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "118",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "119",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "8",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "119",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "119",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "119",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "8",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "119",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "8",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "119",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "8",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "120",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "8",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "120",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "120",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "120",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "120",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "120",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "121",
    "전공": "연계전공(과학융합빅데이터)",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "121",
    "전공": "부전공, 복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "121",
    "전공": "부전공, 복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "121",
    "전공": "부전공, 복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "121",
    "전공": "부전공, 복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "121",
    "전공": "부전공, 복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "122",
    "전공": "부전공, 복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "122",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "122",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "122",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "122",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "122",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "123",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "123",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "123",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "123",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "123",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "123",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "124",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "124",
    "전공": "부전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "124",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "124",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "124",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "124",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "125",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "125",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "125",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "125",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "125",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "125",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "126",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "126",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "126",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "126",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "126",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "126",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "127",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "127",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "127",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "127",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "127",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "127",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "128",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "128",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "128",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "128",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "128",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "128",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "7",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "129",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "129",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "7",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "129",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "129",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "7",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "129",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "129",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "130",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "130",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "130",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "130",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "130",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "130",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "131",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "131",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "131",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "16",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "131",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "131",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "131",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "132",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "132",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "132",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "16",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "132",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "132",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "132",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "133",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "133",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "16",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "133",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "133",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "133",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "133",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "134",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "134",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "134",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "134",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "134",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "134",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "135",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "10",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "135",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "135",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "135",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "135",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "10",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "135",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "10",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "136",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "136",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "136",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "136",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "136",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "136",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "137",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "137",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "137",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "137",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "137",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "기계학습활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "137",
    "전공": "복수전공",
    "학년": "3학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "138",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "138",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "138",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "138",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "138",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "영상처리",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "138",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "139",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "139",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "139",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "9",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "139",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "139",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "139",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "9",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "140",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "9",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "140",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "9",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "140",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "140",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "베이지안통계학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "140",
    "전공": "연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "140",
    "전공": "부전공, 복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "141",
    "전공": "부전공, 복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "141",
    "전공": "부전공, 복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "5",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "141",
    "전공": "부전공, 복수전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "5",
    "과목명": "다변량자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "141",
    "전공": "부전공, 복수전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "5",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "141",
    "전공": "복수전공, 연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "141",
    "전공": "복수전공, 연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "142",
    "전공": "복수전공, 연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "142",
    "전공": "복수전공, 연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "빅데이터개론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "142",
    "전공": "복수전공, 연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "142",
    "전공": "복수전공, 연계전공(빅데이터AI)",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "캡스톤디자인 2",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "142",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "142",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터시각화",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "143",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "생명과학자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "143",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "143",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "143",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "인과추론",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "143",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "3",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "143",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "3",
    "과목명": "인공지능및딥러닝활용",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "144",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "3",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "144",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "데이터관리및처리",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "144",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "확률의개념및응용",
    "구분": "전필",
    "비고": ""
  },
  {
    "학생ID": "144",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "2학년과목",
    "총선택과목수": "6",
    "과목명": "회귀분석",
    "구분": "전필",
    "비고": "부전공필수교과목"
  },
  {
    "학생ID": "144",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "3학년과목",
    "총선택과목수": "6",
    "과목명": "시계열자료분석",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "144",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "금융통계",
    "구분": "전선",
    "비고": ""
  },
  {
    "학생ID": "145",
    "전공": "복수전공",
    "학년": "2학년",
    "과목학년": "4학년과목",
    "총선택과목수": "6",
    "과목명": "보험수리학",
    "구분": "전선",
    "비고": ""
  }
];